
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/hito1991/aws-ecs-terraform/actions/runs/7277080079)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-054815ee42e698c78]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0b757b327cfadf5bc]
aws_security_group.ecs: Refreshing state... [id=sg-04141638f33bbb89a]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:846128074014:targetgroup/go-simple-server-target-group/ec92018886c7dd47]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-02373311b2da3577e]
aws_security_group.alb: Refreshing state... [id=sg-02df84af4230ab692]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-01eb1db15aa20540b]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0618c79d2329f7595]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-08523ac720dda1864]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0312259101dd7ed7a]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0322d3fc7701247b9]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-04b70642bce536260]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0369ec0e37dc36ad9]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-09b6624041ec92195]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0c809db5600d00892]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-3377403824]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0ad6fcdea1e056c91]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0312259101dd7ed7a1080289494]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-09e3dc784389d9586]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-03bff2c6743ffb031]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08256c2b81bd646e1]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:846128074014:loadbalancer/app/go-simple-server-alb/1d6a8fef77710419]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0d8732445b2c7e42b]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-09e8979b16fa91f08]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0ecfb5f7cfdfa1bde]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0956d55a039c2db70]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0c809db5600d008921080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-09b6624041ec921951080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:846128074014:listener/app/go-simple-server-alb/1d6a8fef77710419/902f52493aff1692]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:846128074014:listener-rule/app/go-simple-server-alb/1d6a8fef77710419/902f52493aff1692/6170cc4a70690a54]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.ecr_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "ecr_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 30
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "go-simple-server"
    }

  # aws_ecr_repository.ecr_repository will be created
  + resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "go-simple-server"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
aws_ecr_repository.ecr_repository: Creating...
aws_ecr_repository.ecr_repository: Creation complete after 1s [id=go-simple-server]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creating...
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creation complete after 1s [id=go-simple-server]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":10,"Program":"tfcmt","SHA1":"384c8d55acaf9a0e13c1cab106b7d13a95eec946","Vars":{},"WorkflowName":"Terraform"} -->